[
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix Leaking Refrigerator",
    "url": "https://www.partselect.com/Repair/Refrigerator/Leaking/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"Door gaskets or seals are found along the outside of the refrigerator\\u2019s doors. They are normally made from a vinyl material and will typically have a flexible magnetic strip inside to adhere to the cabinet when the door is closed to create an airtight seal. If there is moisture along the edge of the door then inspect the gaskets for distortion or damage. Air leakage through a defective gasket will create excessive moisture in the refrigerator, possibly resulting in defrost issues and potential w\"}, {\"step_number\": 2, \"instruction\": \"How to inspect refrigerator door gaskets or seals:\"}, {\"step_number\": 3, \"instruction\": \"The water inlet valve is a solenoid-operated device that connects your household water supply line to your refrigerator if you have an ice maker or water dispenser. When activated, it diverts water from the supply line to the dispenser or to fill your ice maker.\"}, {\"step_number\": 4, \"instruction\": \"How to check the water inlet valve in a refrigerator with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"If your fridge is leaking water from in or around the ice maker, you\\u2019re probably also experiencing problems with the ice distribution itself. The cubes may be too small, one solid block of ice or not being produced at all. Inspect the ice maker mold to see if there are ice cubes present. If there are no cubes or very small cubes, then you should look for issues with the water fill system.\"}, {\"step_number\": 6, \"instruction\": \"How to inspect a refrigerator\\u2019s ice maker assembly:\"}, {\"step_number\": 7, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 7,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=UFqbhptfnwA",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > LEAKING\n    \nHow To Fix Leaking Refrigerator\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Door Gaskets Or Seals\n                        \n\n                            Water Inlet Valve\n                        \n\n                            Ice Maker Assembly\n                        \n\n\nAbout this repair:\n\nRated as EASY3265 repair stories18 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nDoor Gaskets Or Seals\n\n\nDoor gaskets or seals are found along the outside of the refrigerator’s doors. They are normally made from a vinyl material and will typically have a flexible magnetic strip inside to adhere to the cabinet when the door is closed to create an airtight seal. If there is moisture along the edge of the door then inspect the gaskets for distortion or damage. Air leakage through a defective gasket will create excessive moisture in the refrigerator, possibly resulting in defrost issues and potential water leaks.\nHow to inspect refrigerator door gaskets or seals:\n\nAfter unplugging your refrigerator, open the fridge and freezer doors to inspect the door gaskets or seals.\nYou are looking for any discoloration, mold, wear, missing pieces, or anything else that may prevent a proper seal.\nIf you find any of the above, you will need replacement gaskets or seals.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Seals and Gaskets\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nWater Inlet Valve\n\n\nThe water inlet valve is a solenoid-operated device that connects your household water supply line to your refrigerator if you have an ice maker or water dispenser. When activated, it diverts water from the supply line to the dispenser or to fill your ice maker.\nHow to check the water inlet valve in a refrigerator with a multi-meter:\n\nUnplug your refrigerator, disconnect the water supply and locate your water inlet valve. It is usually on the rear of the fridge, near the bottom. You will need to remove the rear panel to access it.\nInspect the valve inlet supply connections for leaks and tighten or replace the connectors. You should also inspect the valve body for any cracks or damage. Check the outlet tubing for cracks or abrasions that may also create a leak and replace any cracked or brittle tubing and connectors.\nIf none of the above appear to be the cause of the leak, remove the water inlet valve from the unit.\nUsing a multi-meter on the Rx1 setting, test your valve for conitniuty by placing the probes on the valve’s terminals. You should receive a reading of 200 to 500 ohms.\nIf you receive any other reading, you need a replacement water inlet valve.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Valves\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a water inlet valveHow to replace a water inlet valve\n\n\n\n\n\nBack to Top\n\n\nIce Maker Assembly\n\n\nIf your fridge is leaking water from in or around the ice maker, you’re probably also experiencing problems with the ice distribution itself. The cubes may be too small, one solid block of ice or not being produced at all. Inspect the ice maker mold to see if there are ice cubes present. If there are no cubes or very small cubes, then you should look for issues with the water fill system.\nHow to inspect a refrigerator’s ice maker assembly:\n\nDisconnect your appliance from both the power source and water source.\nInspect the fill tube and the fill cup area at the back of the icemaker to make sure that they are not frozen. If there is an ice buildup in that area, confirm no foreign objects have disrupted the flow of water into the fill cup.\n Inspect the outlet tubing from the fill valve to the ice maker fill tube for any signs of restrictions.\nIf any issues are found while performing the checks above, you will may a replacement ice maker assembly. If nothing obvious has caused the ice buildup, then suspect the inlet valve or tubing.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Ice Makers\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n✖",
    "scraped_at": "2026-02-11T19:36:05.319346"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator That Will Not Start",
    "url": "https://www.partselect.com/Repair/Refrigerator/Will-Not-Start/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"The overload relay is a protection device used in the compressor circuit on your refrigerator. Power is applied to the compressor motor windings through the overload device, and the relay is used to add the start winding in the circuit until the compressor is at running speed. If the fans are running and your compressor won\\u2019t start or if you hear a clicking sound from the unit, check the overload relay for signs of overheating or arcing.\"}, {\"step_number\": 2, \"instruction\": \"How to test a refrigerator\\u2019s overload or relay-start capacitor with a multi-meter:\"}, {\"step_number\": 3, \"instruction\": \"The cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If your refrigerator won\\u2019t start and no fans are running, then you may have a defective control.\"}, {\"step_number\": 4, \"instruction\": \"How to test your fridge\\u2019s cold control & temperature control with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"Some newer refrigerators are controlled by an Electronic Control Board that monitors temperatures and controls the compressor, fans and defrost system. If your refrigerator will not start, the control board could be at fault. Electronic controls are complex and expensive. You should first verify that there is no power being supplied to the compressor, that you have incoming power to the control board and that the external controls are functioning properly before condemning the electronic control\"}, {\"step_number\": 6, \"instruction\": \"How to inspect your refrigerator\\u2019s electronic control board:\"}, {\"step_number\": 7, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 7,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=dGdrBnsEZug",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > WILL NOT START\n    \nHow To Fix A Refrigerator That Will Not Start\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Overload Or Relay-Start Capacitor\n                        \n\n                            Cold Control & Temperature Control\n                        \n\n                            Electronic Control Board\n                        \n\n\nAbout this repair:\n\nRated as EASY365 repair stories8 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nOverload Or Relay-Start Capacitor\n\n\nThe overload relay is a protection device used in the compressor circuit on your refrigerator. Power is applied to the compressor motor windings through the overload device, and the relay is used to add the start winding in the circuit until the compressor is at running speed. If the fans are running and your compressor won’t start or if you hear a clicking sound from the unit, check the overload relay for signs of overheating or arcing.\nHow to test a refrigerator’s overload or relay-start capacitor with a multi-meter:\n\nBegin by ensuring you have unplugged your refrigerator, and then remove the rear panel.\nLocate and remove your overload or relay-start capacitor. On modern refrigerators the overload relay is usually a combined part and plugs directly onto the side of the compressor. There may also be a start capacitor attached to the relay overload assembly, which provides increased starting voltage to the compressor windings.\nTo test, begin by discharging the capacitor, then set your multi-meter to the Rx1 setting and place the probes onto the terminals of the overload capacitor and/or the relay-start capacitor. The reading you should receive will vary from model to model, and may be indicated on the outside of the capacitor, or in your owner’s manual.\nIf your test does not produce the reading the manufacturer recommends, you need a replacement overload or relay-start capacitor. If your tests do produce the recommended readings you may have a defective compressor, which will need to be tested by a qualified professional as it is a live circuit test.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nCold Control & Temperature Control\n\n\nThe cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If your refrigerator won’t start and no fans are running, then you may have a defective control.\nHow to test your fridge’s cold control & temperature control with a multi-meter:\n\nAfter disconnecting your appliance from the power source, open your refrigerator door and locate the control. It will be located behind the temperature adjustment knob and is usually found in the fresh food section control panel.\nRemove the control from the fridge in order to test it.\nUsing a multi-meter on the Rx1 setting, set your control to the lowest (warmest) setting, and place the probes on the terminals. You are testing for continuity and you should receive a reading of infinity.\nWith the probes still on the terminals, adjust the control to higher (colder) and higher settings, your reading should then change to zero, indicating that you have continuity.\nIf your control fails either of the tests above, you will need a replacement cold control & temperature control.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nElectronic Control Board\n\n\nSome newer refrigerators are controlled by an Electronic Control Board that monitors temperatures and controls the compressor, fans and defrost system. If your refrigerator will not start, the control board could be at fault. Electronic controls are complex and expensive. You should first verify that there is no power being supplied to the compressor, that you have incoming power to the control board and that the external controls are functioning properly before condemning the electronic control.\nHow to inspect your refrigerator’s electronic control board:\n\nEnsure that you have disconnected your appliance from the power before beginning as you will be handling electrical components.\nOpen your refrigerator door to locate and remove the electronic control board from your appliance. It will be located inside the control box, which is usually found attached to the top or side of the fridge.\nLook on the control board for signs of arcing, burnt connections, damaged foil, wear, or any other damage.\nIf you find any of the above, you need a replacement electronic control board.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Circuit Boards and Touch Pads\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed he",
    "scraped_at": "2026-02-11T19:36:05.406498"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Noisy Refrigerator",
    "url": "https://www.partselect.com/Repair/Refrigerator/Noisy/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"Most modern frost-free refrigerators will have a fan cooled condenser coil. The condenser fan circulates air through the condenser coil to remove heat as well as circulating air over the drain pan to evaporate the defrost water. If your fridge is making a loud noise, the condenser fan motor could be to blame. The condenser fan motor runs at the same time as the evaporator motor and the compressor. In addition to noise, your fridge might not be staying as cool as normal and/or may be turning on a\"}, {\"step_number\": 2, \"instruction\": \"How to inspect a refrigerator condenser fan motor:\"}, {\"step_number\": 3, \"instruction\": \"The evaporator fan motor is responsible for pulling air over the evaporator coils when the compressor is running. If your refrigerator is making a loud noise that appears to be coming from the freezer area, a faulty evaporator fan motor could be to blame. You may also notice that your refrigerator is not staying as cold as normal, or your ice is taking longer to freeze.\"}, {\"step_number\": 4, \"instruction\": \"How to inspect a refrigerator evaporator fan motor:\"}, {\"step_number\": 5, \"instruction\": \"The evaporator fan motor grommet is used to isolate the motor from the mounting bracket and reduce vibration noise. Regular wear and tear can cause the grommets to wear or become detached, which can increase vibration and cause excess noise.\"}, {\"step_number\": 6, \"instruction\": \"How to check a refrigerator\\u2019s evaporator fan motor grommets:\"}, {\"step_number\": 7, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 7,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=nxHx8mhOnvY",
    "video_count": 1,
    "full_content": "REPAIR >  REFRIGERATOR  > TOO NOISY\n    \nHow To Fix A Noisy Refrigerator\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Condenser Fan Motor\n                        \n\n                            Evaporator Fan Motor\n                        \n\n                            Evaporator Fan Motor Grommet\n                        \n\n\nAbout this repair:\n\nRated as EASY1875 repair stories33 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nCondenser Fan Motor\n\n\nMost modern frost-free refrigerators will have a fan cooled condenser coil. The condenser fan circulates air through the condenser coil to remove heat as well as circulating air over the drain pan to evaporate the defrost water. If your fridge is making a loud noise, the condenser fan motor could be to blame. The condenser fan motor runs at the same time as the evaporator motor and the compressor. In addition to noise, your fridge might not be staying as cool as normal and/or may be turning on and off regularly.\nHow to inspect a refrigerator condenser fan motor:\n\nDisconnect your refrigerator from the power source and then remove the rear access panel.\nLocate the condenser fan motor, it is usually found near the compressor at the bottom rear of the refrigerator.\nVisually inspect the condenser fan motor for any signs of wear or damage. Look for any debris or obstructions that could be preventing the fan from moving freely.\nIf the fan motor is seized or worn, you will need a replacement condenser fan motor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Motors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nEvaporator Fan Motor\n\n\nThe evaporator fan motor is responsible for pulling air over the evaporator coils when the compressor is running. If your refrigerator is making a loud noise that appears to be coming from the freezer area, a faulty evaporator fan motor could be to blame. You may also notice that your refrigerator is not staying as cold as normal, or your ice is taking longer to freeze.\nHow to inspect a refrigerator evaporator fan motor:\n\nAfter unplugging your refrigerator, remove the evaporator fan cover. The evaporator fan cover is located inside the unit in the freezer compartment.\nInspect the evaporator motor for any signs of wear or damage. If there is a significant amount of ice on the motor, defrost your freezer and see if that resolves the issue.\nAttempt to manually turn the motor shaft, it should turn freely with minimal resistance.\nIf you cannot turn it easily, or if it is noticeably worn, you need a replacement evaporator fan motor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Motors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nEvaporator Fan Motor Grommet\n\n\nThe evaporator fan motor grommet is used to isolate the motor from the mounting bracket and reduce vibration noise. Regular wear and tear can cause the grommets to wear or become detached, which can increase vibration and cause excess noise.\nHow to check a refrigerator’s evaporator fan motor grommets:\n\nUnplug your refrigerator.\nRemove the evaporator fan cover, which will be found inside the freezer compartment.\nInspect the grommet to see if it has fallen off, or it if is showing signs of wear or damage..\nIf any of the above are true, you will need a replacement evaporator fan motor grommet.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n✖",
    "scraped_at": "2026-02-11T19:36:05.620400"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To A Fix Refrigerator That's Not Dispensing Water",
    "url": "https://www.partselect.com/Repair/Refrigerator/Not-Dispensing-Water/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"If so equipped, the ice and water filter in your refrigerator is responsible for removing any debris or contaminants from your water that may remain after local water treatment. Most filters contain and are made up of carbon and a fabric filter. Over time the filter may become restricted and reduce or stop the water flow to the dispenser. Most manufacturers recommend replacing the filter every 6 months, but local water conditions may require that you replace more frequently.\"}, {\"step_number\": 2, \"instruction\": \"How to inspect your refrigerator\\u2019s ice and water filter:\"}, {\"step_number\": 3, \"instruction\": \"The water inlet valve is a solenoid-operated device that supplies water to the dispenser when activated. When water is selected at the dispenser control panel, line voltage is supplied to the solenoid of the water inlet valve to allow water to flow. Verify that you have adequate pressure at the inlet to the valve, that the inlet screen is not plugged and that there are no restrictions in the inlet or outlet tubing.\"}, {\"step_number\": 4, \"instruction\": \"How to test your refrigerator\\u2019s water inlet valve with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"The water dispenser actuator is the mechanical part that activates the dispenser micro switch. It is normally a plastic lever that pivots when depressed by your water glass, and it may be covered with a soft plastic pad. You can usually hear a click when the switch is contacted.\"}, {\"step_number\": 6, \"instruction\": \"How to inspect a refrigerator water dispenser actuator:\"}, {\"step_number\": 7, \"instruction\": \"The dispenser micro switch is a momentary contact switch that when actuated will supply power to the solenoid on the water inlet valve.\"}, {\"step_number\": 8, \"instruction\": \"How to test a refrigerator micro switch with a multi-meter:\"}, {\"step_number\": 9, \"instruction\": \"Some models of refrigerators use an electronic control to supply power to the water inlet valve. If you have verified that the water inlet valve is not getting power and the actuator and switch are operating properly, then you may have a defective electronic control.\"}, {\"step_number\": 10, \"instruction\": \"How to inspect a refrigerator\\u2019s dispenser control board:\"}, {\"step_number\": 11, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 11,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=Q8PMGWyvry4",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > DISPENSER WILL NOT DISPENSE WATER\n    \nHow To A Fix Refrigerator That's Not Dispensing Water\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Ice & Water Filter\n                        \n\n                            Water Inlet Valve\n                        \n\n                            Water Dispenser Actuator\n                        \n\n                            Micro Switch\n                        \n\n                            Dispenser Control Board\n                        \n\n\nAbout this repair:\n\nRated as EASY1940 repair stories29 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nIce & Water Filter\n\n\nIf so equipped, the ice and water filter in your refrigerator is responsible for removing any debris or contaminants from your water that may remain after local water treatment. Most filters contain and are made up of carbon and a fabric filter. Over time the filter may become restricted and reduce or stop the water flow to the dispenser. Most manufacturers recommend replacing the filter every 6 months, but local water conditions may require that you replace more frequently.\nHow to inspect your refrigerator’s ice and water filter:\n\nConsider when you last changed your ice and water filter. How frequently you need to change your filter varies by model and local water conditions, but you should never exceed 12 months of use per filter.\nFind and remove your water filter. The exact location differs from model to model, but it is commonly located in the water line leading to the fridge, behind the base grill, or inside the unit attached to the rear corner or ceiling. If your filter is in the water line, you will need to disconnect the water supply before beginning.\nWith the variety of locations and removal instructions, we recommend you follow brand specific directions, or refer to your owner’s manual for specific directions. Take note of the installation date on your calendar before installing the new filter.\nIf your filter is damaged or clogged, or if you have exceeded the manufacturers’ recommended guidelines, you will need a replacement ice and water filter.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Filters\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to remove and replace a water filter\n\n\n\n\n\nBack to Top\n\n\nWater Inlet Valve\n\n\nThe water inlet valve is a solenoid-operated device that supplies water to the dispenser when activated. When water is selected at the dispenser control panel, line voltage is supplied to the solenoid of the water inlet valve to allow water to flow. Verify that you have adequate pressure at the inlet to the valve, that the inlet screen is not plugged and that there are no restrictions in the inlet or outlet tubing.\nHow to test your refrigerator’s water inlet valve with a multi-meter:\n\nAfter disconnecting the water supply and unplugging your refrigerator, remove the rear access panel and locate the water inlet valve. It is usually found near the bottom of the fridge.\nBegin by inspecting all the tubing, and their respective connections, for leaks, damage, wear, abrasions, or brittle tubing.\nIf you do not locate the source of the leak in the above checks, remove the water inlet valve to test it.\nWith a multi-meter in Rx1 mode, touch the terminals with the probes to test for continuity. A functional water inlet valve should put off a reading of 200 to 500 ohms. \nIf you receive any other reading, you need a replacement water inlet valve.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Valves\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a water inlet valveHow to replace a water inlet valve\n\n\n\n\n\nBack to Top\n\n\nWater Dispenser Actuator\n\n\nThe water dispenser actuator is the mechanical part that activates the dispenser micro switch. It is normally a plastic lever that pivots when depressed by your water glass, and it may be covered with a soft plastic pad. You can usually hear a click when the switch is contacted.\nHow to inspect a refrigerator water dispenser actuator:\n\nUnplug your appliance and turn off the water supply to the refrigerator.\nRemove the control panel cover and verify that the actuator contacts the dispenser switch properly and if not, check the actuator housing bracket, switch mounting bracket and the actuator pivot itself.\nIf you find any issues, you may need a replacement water dispenser actuator. If the actuator is contacting the switch, you will need to check the switch or control board for the source of the problem.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Dispensers\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nMicro Switch\n\n\nThe dispenser micro switch is a momentary contact switch that when actuated will supply power to the solenoid on the water inlet valve.\nHow to test a refrigerator micro switch with a multi-meter:\n\nDisconnect the refrigerator from the power source and turn off the water supply",
    "scraped_at": "2026-02-11T19:36:09.606478"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator That's Too Warm",
    "url": "https://www.partselect.com/Repair/Refrigerator/Refrigerator-Too-Warm/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"The air damper, baffle or diffuser is the device that balances the air flow from the evaporator fan housing. This normally is a mechanically controlled baffle or flapper that controls the amount of cold air entering the fresh food compartment. If the baffle is damaged or the linkage to the control knob is damaged, then you may not have enough cold air entering the fresh food compartment resulting in higher than normal temperatures.\"}, {\"step_number\": 2, \"instruction\": \"How to inspect a refrigerator\\u2019s air inlet damper or baffle:\"}, {\"step_number\": 3, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 3,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=da9oya03Kvo",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > FRIDGE TOO WARM\n    \nHow To Fix A Refrigerator That's Too Warm\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Air Inlet Damper Or Baffle\n                        \n\n\nAbout this repair:\n\nRated as REALLY EASY16 repair stories\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nAir Inlet Damper Or Baffle\n\n\nThe air damper, baffle or diffuser is the device that balances the air flow from the evaporator fan housing. This normally is a mechanically controlled baffle or flapper that controls the amount of cold air entering the fresh food compartment. If the baffle is damaged or the linkage to the control knob is damaged, then you may not have enough cold air entering the fresh food compartment resulting in higher than normal temperatures.\nHow to inspect a refrigerator’s air inlet damper or baffle:\n\nDisconnect your refrigerator from the power source and open your refrigerator door to locate the damper or baffle. It will be found where the cold air enters the fresh food compartment.\n The housing that the baffle or damper is encased in is often made of plastic with a Styrofoam lining and may have a foam seal to prevent air leakage. Care should be used when inspecting the housing to avoid damage to the seal or the Styrofoam.\n Some refrigerator models use a temperature sensing bulb attached to this control that will automatically adjust the control for changes in the interior temperature. Make sure that the sensing bulb is in the correct position and is not damaged.\nAttempt to operate the control knob to verify that the linkage is intact and that it moves freely.\nIf the damper/baffle is stuck in the closed or nearly closed position or does not move freely, then you need a replacement air inlet damper or baffle.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n✖",
    "scraped_at": "2026-02-11T19:36:09.836340"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator That's Not Making Ice",
    "url": "https://www.partselect.com/Repair/Refrigerator/Not-Making-Ice/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"Inspect the ice maker mold to see if there are ice cubes present. If there are no cubes or very small cubes, then you should look for issues with the water fill system.\"}, {\"step_number\": 2, \"instruction\": \"How to inspect your refrigerator\\u2019s water fill tubes:\"}, {\"step_number\": 3, \"instruction\": \"Some water inlet valves may have a screen to filter debris before it can enter the valve. If the screen is plugged, water flow will be restricted, and the result will be small or layered ice cubes. Remove and clean the screen if it is clogged. If dirt has gotten into the valve it may not shut off completely and will continuously drip water into the ice maker fill tube and will eventually freeze up. Low household water pressure or a restriction at the manual shut off valve will also cause the wat\"}, {\"step_number\": 4, \"instruction\": \"How to check the water inlet valve in a refrigerator with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"If equipped, the Ice and Water filter in your refrigerator is responsible for removing any debris or contaminants from your water that may remain after local water treatment. Most filters contain and are made up of carbon and fabric filter. Over time, the filter may become restricted and reduce the water flow to the ice maker, causing a symptom of little or no ice. Most manufacturers recommend replacing the filter every 6 months, but local water conditions may require that you replace more frequ\"}, {\"step_number\": 7, \"instruction\": \"How to inspect your refrigerator\\u2019s ice and water filter:\"}, {\"step_number\": 8, \"instruction\": \"If there are no ice buildup issues or suspected problems with the water supply, then you may have a problem with the ice maker control. The most common type of ice maker used in modern refrigerators is the heat release ice maker. The testing procedure for the heat release ice maker involves a live voltage test, consequently it should only be performed by a qualified professional. However, the issue may also be related to the water fill system or the ice maker assembly.\"}, {\"step_number\": 9, \"instruction\": \"How to inspect your refrigerator\\u2019s ice maker assembly:\"}, {\"step_number\": 10, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 9,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=I6Sgbo-CB3s",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > WILL NOT MAKE ICE\n    \nHow To Fix A Refrigerator That's Not Making Ice\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Water Fill Tubes\n                        \n\n                            Water Inlet Valve\n                        \n\n                            Ice & Water Filter\n                        \n\n                            Ice Maker Assembly & Replacement Ice Maker\n                        \n\n\nAbout this repair:\n\nRated as EASY3458 repair stories23 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nWater Fill Tubes\n\n\nInspect the ice maker mold to see if there are ice cubes present. If there are no cubes or very small cubes, then you should look for issues with the water fill system.\nHow to inspect your refrigerator’s water fill tubes:\n\nBefore beginning, disconnect both the power and water source from your refrigerator.\nAt the back of the icemaker, inspect the fill tube and the fill cup area at the back of the ice maker to make sure that they are not frozen. If there is an ice buildup in that area, confirm no foreign objects have disrupted the flow of water into the fill cup.\n Inspect the outlet tubing from the fill valve to the ice maker fill tube for any signs of restrictions.\nIf you find any issues while performing the checks above, you will need replacement water fill tubes.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Hoses and Tubes\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nWater Inlet Valve\n\n\nSome water inlet valves may have a screen to filter debris before it can enter the valve. If the screen is plugged, water flow will be restricted, and the result will be small or layered ice cubes. Remove and clean the screen if it is clogged. If dirt has gotten into the valve it may not shut off completely and will continuously drip water into the ice maker fill tube and will eventually freeze up. Low household water pressure or a restriction at the manual shut off valve will also cause the water inlet valve to not shut off completely and create this same condition. Self piercing saddle valves are the most common shut off valve to cause this problem as the hole that is pierced in the water line is often too small and will more easily become restricted.\nHow to check the water inlet valve in a refrigerator with a multi-meter:\n\nDisconnect your appliance from the power and water source before beginning.\nRemove the rear access panel and locate your water inlet valve, it is usually found near the bottom.\nBefore removing the inlet valve, look for any signs of leaks or loose connectors in the valve inlet supply. If no issues are found, inspect the valve body for any cracks or damage.\nInspect the outlet tubing for any brittle tubing, abrasions, cracks, or any other damage.\nIf you do not locate any leaks, disconnect the water inlet valve and remove it from the refrigerator to test it\nSet your multi-meter to the Rx1 setting and touch the terminals with the probes. You are testing for continuity and should receive a reading of 200 to 500 ohms.\nIf you receive any other reading, you need a replacement water inlet valve.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Valves\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a water inlet valveHow to replace a water inlet valve\n\n\n\n\n\nBack to Top\n\n\nIce & Water Filter\n\n\nIf equipped, the Ice and Water filter in your refrigerator is responsible for removing any debris or contaminants from your water that may remain after local water treatment. Most filters contain and are made up of carbon and fabric filter. Over time, the filter may become restricted and reduce the water flow to the ice maker, causing a symptom of little or no ice. Most manufacturers recommend replacing the filter every 6 months, but local water conditions may require that you replace more frequently.\nHow to inspect your refrigerator’s ice and water filter:\n\nDetermine when you last replaced your water filter. Replacement frequency varies by model and local water quality, but you should never go longer than 12 months without replacing your water filter.\nLocate your water filter. Location varies by model and brand, but it is often found inside the unit attached to the ceiling or back corner, behind the base grill, or in the water line leading to the fridge. If your filter is in the water line, you will need to turn off the water supply before removing the filter.\nDue to the variety of filters and placements we suggest you follow brand specific install instructions or refer to manufacturer guidelines. Before installing the new filter note the install date on the filter or on your calendar.\nIf it has been longer than the manufacturer recommended guidelines, or you filter is damaged, you will need a replacement ice and water filter.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Filters\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to remove ",
    "scraped_at": "2026-02-11T19:36:12.666042"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator Door That's Sweating",
    "url": "https://www.partselect.com/Repair/Refrigerator/Door-Sweating/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"Leaky or damaged door seals can create excess moisture that is visible near the air outlet ducts or on shelves in the freezer. Damaged gaskets can also prevent doors from closing properly and may introduce enough moisture into the refrigerator that defrost issues may occur. Moisture along the edge of the door is a good indication that the gaskets are not sealing properly and should be replaced.\"}, {\"step_number\": 2, \"instruction\": \"How to inspect refrigerator door gaskets:\"}, {\"step_number\": 3, \"instruction\": \"When activated, the ice dispenser door opens so that ice can be dispensed from the icemaker. The door or flapper is normally spring loaded and will have a vinyl or foam rubber seal attached to prevent room air from entering the refrigerator. If there is moisture around the front of the dispenser or if there is signs of moisture in the ice bin area, then this would indicate that the door is not closing completely. The flapper door is hinged and is normally operated by a solenoid with a return spr\"}, {\"step_number\": 4, \"instruction\": \"How to inspect a refrigerator dispenser door assembly or flapper & ice door kit:\"}, {\"step_number\": 5, \"instruction\": \"In some models of side-by-side refrigerators, closer cams on the lower door hinges are used to assist in closing the doors. The cams are made of hard plastic or nylon and have sloped shoulders on them that mate together. One cam is mounted to the bottom of the door and the other is mounted to the top of the hinge. When the door is opened, the door cam rotates up out of the hinge cam, lifting the door up and a detent allows it to stay in an open position. When closing the door, the weight of the \"}, {\"step_number\": 6, \"instruction\": \"How to inspect your refrigerator\\u2019s door closure cam kit:\"}, {\"step_number\": 7, \"instruction\": \"Fresh food and freezer doors rotate on hinges. The hinges act as bearings and the doors should pivot easily on them. If the hinges become worn or dry of lubricant, they may prevent the doors from closing completely. This could allow room air into the refrigerator and cause moisture problems. A common symptom of a faulty hinge bearing is when opening or closing the door a thumping and/or scraping noise can be heard.\"}, {\"step_number\": 8, \"instruction\": \"How to check your refrigerator\\u2019s door hinge & bearings:\"}, {\"step_number\": 9, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 9,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=dGdrBnsEZug",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > SWEATING DOOR\n    \nHow To Fix A Refrigerator Door That's Sweating\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Fresh Food & Freezer Door Gasket\n                        \n\n                            Dispenser Door Assembly or Flapper & Ice Door Kit\n                        \n\n                            Door Closure Cam Kit\n                        \n\n                            Door Hinge & Bearing\n                        \n\n\nAbout this repair:\n\nRated as EASY769 repair stories11 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nFresh Food & Freezer Door Gasket\n\n\nLeaky or damaged door seals can create excess moisture that is visible near the air outlet ducts or on shelves in the freezer. Damaged gaskets can also prevent doors from closing properly and may introduce enough moisture into the refrigerator that defrost issues may occur. Moisture along the edge of the door is a good indication that the gaskets are not sealing properly and should be replaced.\nHow to inspect refrigerator door gaskets:\n\nTake a piece of paper, and place it at various points along the door.\nClose the door normally and slide the paper out.\nIf the paper slides out without any resistance, then you will need replacement fresh food & freezer door gasket(s).\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Seals and Gaskets\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nDispenser Door Assembly or Flapper & Ice Door Kit\n\n\nWhen activated, the ice dispenser door opens so that ice can be dispensed from the icemaker. The door or flapper is normally spring loaded and will have a vinyl or foam rubber seal attached to prevent room air from entering the refrigerator. If there is moisture around the front of the dispenser or if there is signs of moisture in the ice bin area, then this would indicate that the door is not closing completely. The flapper door is hinged and is normally operated by a solenoid with a return spring and often with a damper to slow the closing action to prevent the door from closing on an ice cube.\nHow to inspect a refrigerator dispenser door assembly or flapper & ice door kit:\n\nRemove the dispenser cover in order to inspect its components.\nYou should inspect the following parts for damage or wear.\n\nDoor hinges.\nDoor seal.\nDoor pivot mechanism.\nReturn spring.\nSolenoid plunger and linkage.\nDamper.\n\nIf you find any issues while checking the above parts, you may need a replacement dispenser door assembly or flapper & ice door kit.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Doors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nDoor Closure Cam Kit\n\n\nIn some models of side-by-side refrigerators, closer cams on the lower door hinges are used to assist in closing the doors. The cams are made of hard plastic or nylon and have sloped shoulders on them that mate together. One cam is mounted to the bottom of the door and the other is mounted to the top of the hinge. When the door is opened, the door cam rotates up out of the hinge cam, lifting the door up and a detent allows it to stay in an open position. When closing the door, the weight of the door forces the door to pivot closed as the cams mate together. If either of these cams is broken, then the door may not close tightly. This would allow warm outside air to enter the refrigerator and cause condensation to form.\nHow to inspect your refrigerator’s door closure cam kit:\n\nOpen your refrigerator door and locate the closer cams.\nVisually inspect the closer cams to verify that they are not cracked, worn, or otherwise damaged.\nIf they are damaged, you will need a replacement closure cam kit.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nDoor Hinge & Bearing\n\n\nFresh food and freezer doors rotate on hinges. The hinges act as bearings and the doors should pivot easily on them. If the hinges become worn or dry of lubricant, they may prevent the doors from closing completely. This could allow room air into the refrigerator and cause moisture problems. A common symptom of a faulty hinge bearing is when opening or closing the door a thumping and/or scraping noise can be heard.\nHow to check your refrigerator’s door hinge & bearings:\n\nOpen and remove your refrigerator door in order to locate the hinge & bearing.\nInspect the hinges for any signs of cracking or damage. If they are not damaged, lubricate the hinges with a food safe grease to see if that resolves the issue.\nIf they are damaged or greasing the hinges does not solve the issue, you need replacement door hinges & bearings.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Bearings\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\n",
    "scraped_at": "2026-02-11T19:36:13.814407"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator and Freezer That's Too Warm",
    "url": "https://www.partselect.com/Repair/Refrigerator/Refrigerator-Freezer-Too-Warm/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"The cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If the compressor and fans are operating normally but not running often enough or long enough to maintain the correct temperatures in the fresh food and freezer sections, then the cold control may be defective or out of calibration. Normal fresh food temperatures are in the 38\\u00b0 Fahrenheit range with the control set to mid-point. Verify that the capillary tube or sensing\"}, {\"step_number\": 2, \"instruction\": \"How to test your fridge\\u2019s cold control & temperature control with a multi-meter:\"}, {\"step_number\": 3, \"instruction\": \"The evaporator fan motor is used to circulate the cold air throughout the refrigerator when the compressor is running. If the fan is defective, then temperatures in the freezer section will rise slowly and temperatures in the fresh food section will rise more rapidly and the compressor will run longer and more frequently than normal. With the compressor running you should also hear the evaporator fan running at the same time, as well as the condenser fan which is located next to the compressor.\"}, {\"step_number\": 4, \"instruction\": \"How to inspect a refrigerator evaporator fan motor:\"}, {\"step_number\": 5, \"instruction\": \"Some newer models of refrigerators may use an electronic control board. Thermistors or temperature sensors are connected to the control board and are used to monitor temperatures in the fresh food and freezer compartments. The control board uses this information to control the operation of the compressor, fan motors and defrost system. If the temperatures are too warm, then the electronic control could be at fault. Electronic controls are complex and expensive and usually reliable, so you should\"}, {\"step_number\": 6, \"instruction\": \"How to inspect your refrigerator\\u2019s electronic control board:\"}, {\"step_number\": 7, \"instruction\": \"In models that use an Electronic Control, a thermistor or temperature sensor may be used to monitor fresh food and freezer temperatures. The sensor is a small capsule like device that is protected by a plastic shield and will vary in resistance depending on the temperature. The control board uses this information to turn on the compressor and fan circuits as well as to operate the damper control on some models. If a sensor becomes damaged or defective it may incorrectly signal the control board \"}, {\"step_number\": 8, \"instruction\": \"How to test a refrigerator temperature sensor or thermistor with a multi-meter:\"}, {\"step_number\": 9, \"instruction\": \"The defrost timer is an electro-mechanical timer that operates a set of contacts that control both the compressor circuit as well as the defrost heater circuit. Most timers will activate a defrost cycle every 8-10 hours of compressor run time. This normally occurs about once every day or two. The defrost timer will normally terminate the defrost cycle after 20 to 30 minutes and the compressor and fans will start again.\"}, {\"step_number\": 10, \"instruction\": \"How to test a refrigerator defrost timer with a multi-meter:\"}, {\"step_number\": 11, \"instruction\": \"The defrost thermostat is a safety thermostat in series with the defrost heater and is used to terminate the defrost cycle when the evaporator reaches a specific temperature, usually rated at 38\\u00b0 to 47\\u00b0 Fahrenheit. If the thermostat is defective and remains open circuit, then the defrost heater will not be energized and no defrosting will take place.\"}, {\"step_number\": 12, \"instruction\": \"How to test a refrigerator\\u2019s defrost thermostat with a multi-meter:\"}, {\"step_number\": 13, \"instruction\": \"The defrost heater is the device that melts the ice and frost from the evaporator coils. It is typically a wire filament contained in a glass or aluminum tube. There may be more than one heater depending on the shape of the evaporator.\"}, {\"step_number\": 14, \"instruction\": \"How to test a refrigerator defrost heater with a multi-meter:\"}, {\"step_number\": 15, \"instruction\": \"Most modern frost-free refrigerators will have a fan cooled condenser coil. This normally located near the compressor at the bottom rear of the refrigerator. The condenser fan circulates air through the condenser coil to remove heat. If the refrigerator is warmer than normal and the compressor is running almost continuously, then you may have a problem with the condenser fan motor. The condenser fan motor runs at the same time as the evaporator motor and the compressor. If the fan motor is not t\"}, {\"step_number\": 16, \"instruction\": \"How to inspect a refrigerator condenser fan motor:\"}, {\"step_number\": 17, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 17,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=da9oya03Kvo",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > FRIDGE FREEZER TOO WARM\n    \nHow To Fix A Refrigerator and Freezer That's Too Warm\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Cold Control Or Temperature Control\n                        \n\n                            Evaporator Fan Motor\n                        \n\n                            Electronic Control Board\n                        \n\n                            Temperature Sensor Or Thermistor\n                        \n\n                            Defrost Timer\n                        \n\n                            Defrost Thermostat\n                        \n\n                            Defrost Heater\n                        \n\n                            Condenser Fan Motor\n                        \n\n\nAbout this repair:\n\nRated as EASY785 repair stories15 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nCold Control Or Temperature Control\n\n\nThe cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If the compressor and fans are operating normally but not running often enough or long enough to maintain the correct temperatures in the fresh food and freezer sections, then the cold control may be defective or out of calibration. Normal fresh food temperatures are in the 38° Fahrenheit range with the control set to mid-point. Verify that the capillary tube or sensing bulb is not damaged or out of position and that the wire terminals are not loose or corroded.\nHow to test your fridge’s cold control & temperature control with a multi-meter:\n\nUnplug your refrigerator before beginning, then open your refrigerator door and locate the control. It will be located behind the temperature adjustment knob and is usually found in the fresh food section control panel.\nAfter removing the control from the appliance, turn the control to the warmest setting, set your multi-meter to the Rx1 setting and touch the probes to the terminals\n You are testing for continuity and you should receive a reading of infinity. With the probes still touching the terminals, adjust the control to higher (colder) and higher settings. Your reading should change to zero, indicating that you have continuity.\nIf your control fails either of the tests above, you will need a replacement cold control & temperature control.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nEvaporator Fan Motor\n\n\nThe evaporator fan motor is used to circulate the cold air throughout the refrigerator when the compressor is running. If the fan is defective, then temperatures in the freezer section will rise slowly and temperatures in the fresh food section will rise more rapidly and the compressor will run longer and more frequently than normal. With the compressor running you should also hear the evaporator fan running at the same time, as well as the condenser fan which is located next to the compressor.\nHow to inspect a refrigerator evaporator fan motor:\n\nDisconnect your refrigerator from the power source and remove the evaporator fan cover, which will be found in the freezer compartment.\nThe motor shaft should turn freely with minimal resistance, attempt to turn the shaft manually to check for any resistance.\nIf there is a significant amount of ice on the motor, defrost your freezer and see if that resolves the issue. You should also inspect the motor for any signs of wear or damage.\nIf you cannot turn it easily, or if it is noticeably worn, you need a replacement evaporator fan motor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Motors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nElectronic Control Board\n\n\nSome newer models of refrigerators may use an electronic control board. Thermistors or temperature sensors are connected to the control board and are used to monitor temperatures in the fresh food and freezer compartments. The control board uses this information to control the operation of the compressor, fan motors and defrost system. If the temperatures are too warm, then the electronic control could be at fault. Electronic controls are complex and expensive and usually reliable, so you should first verify that all of the other components such as the compressor, fans and sensors are operating properly before condemning the control. Some manufacturers may provide specific information that will help in diagnosing a defective control.\nHow to inspect your refrigerator’s electronic control board:\n\nUnplug your fridge before beginning as you will be handling electrical components.\nLocate and remove the electronic control board from your appliance. It is inside of the refrigerator, inside of the control box, which is usually found attached to the top or side of the fridge.\nInspect your control board for any signs of damaged foil, wear, burnt connections, arcing, or any other damage.\nIf yo",
    "scraped_at": "2026-02-11T19:36:14.374466"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator Light That's Not Working",
    "url": "https://www.partselect.com/Repair/Refrigerator/Light-Not-Working/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"Most light bulbs or lamps can be checked visually for a broken filament or can be checked with a multi-meter for continuity. You can also simply replace the bulb with a new one.\"}, {\"step_number\": 2, \"instruction\": \"How to test a refrigerator lightbulb with a multi-meter.\"}, {\"step_number\": 3, \"instruction\": \"If you have verified that the light bulb or lamp is not defective, then you should next inspect the socket.\"}, {\"step_number\": 4, \"instruction\": \"How to inspect the light sockets of a refrigerator:\"}, {\"step_number\": 5, \"instruction\": \"The interior light of your refrigerator is controlled by a switch that is activated when the door is opened and closed. If this switch malfunctions the light might not turn on consistently, if at all.\"}, {\"step_number\": 6, \"instruction\": \"How to test a refrigerator door light switch with a multi-meter:\"}, {\"step_number\": 7, \"instruction\": \"If your model has an ice and water dispenser with a light bulb you should first verify that the bulb is good. These lights are normally low wattage and are not designed to be used as night lights. Extended periods of usage will typically cause premature failure of the bulb or damage to the socket. Most models will have an on/off switch on the control panel and that may be defective. You can check the switch for continuity with a multi-meter. The lamp or bulb socket may also be defective and the \"}, {\"step_number\": 8, \"instruction\": \"How to test a refrigerator ice dispenser light on/off switch:\"}, {\"step_number\": 9, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 9,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=dGdrBnsEZug",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR  > LIGHT WON'T TURN ON\n    \nHow To Fix A Refrigerator Light That's Not Working\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Light Bulb Or Lamp\n                        \n\n                            Light Sockets\n                        \n\n                            Door Light Switch\n                        \n\n                            Light Bulb & Ice Dispenser\n                        \n\n\nAbout this repair:\n\nRated as REALLY EASY582 repair stories23 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nLight Bulb Or Lamp\n\n\nMost light bulbs or lamps can be checked visually for a broken filament or can be checked with a multi-meter for continuity. You can also simply replace the bulb with a new one.\nHow to test a refrigerator lightbulb with a multi-meter.\n\nRemove the bulb from the refrigerator.\nSet your multi-meter to the Rx1 setting.\nPlace one probe on the bottom of the lightbulb, and place the other on the threading of the bulb.\nIf you receive a reading of infinity, you need a replacement lightbulb.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Lights and Bulbs\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nLight Sockets\n\n\nIf you have verified that the light bulb or lamp is not defective, then you should next inspect the socket.\nHow to inspect the light sockets of a refrigerator:\n\nUnplug your refrigerator before close inspection of the socket as this is a live voltage circuit.\nInspect the socket for discolored terminals or heat damaged sockets that may prevent good connectivity to the light bulb or lamp.\nIf you find either of the above, you need a replacement light socket.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nDoor Light Switch\n\n\nThe interior light of your refrigerator is controlled by a switch that is activated when the door is opened and closed. If this switch malfunctions the light might not turn on consistently, if at all.\nHow to test a refrigerator door light switch with a multi-meter:\n\nUnplug your refrigerator and locate your door light switch. The location of the switch varies depending on the model of your refrigerator, but it is usually located somewhere near the top of the door opening. The switch is often mounted into the interior plastic liner and care should be taken when removing it to prevent damage to the liner.\nRemove the switch in order to test it.\nSet your multi-meter to the Rx1 setting to test the switch for continuity and place the probes on the switch’s terminals. The multi-meter reading should change from infinity to a reading of zero. Keep the leads touching the terminals and press in on the switch. The reading should change back to infinity.\n If the results you receive are not consistent with these results, you need a replacement door switch.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Switches\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a door switch\nHow to replace a door switch\n\n\n\n\n\nBack to Top\n\n\nLight Bulb & Ice Dispenser\n\n\nIf your model has an ice and water dispenser with a light bulb you should first verify that the bulb is good. These lights are normally low wattage and are not designed to be used as night lights. Extended periods of usage will typically cause premature failure of the bulb or damage to the socket. Most models will have an on/off switch on the control panel and that may be defective. You can check the switch for continuity with a multi-meter. The lamp or bulb socket may also be defective and the control plate will need to be removed for inspection.\nHow to test a refrigerator ice dispenser light on/off switch:\n\nDisconnect your refrigerator from the power source before beginning.\nLocate and remove your control panel cover to access the on/off switch.\nRemove the on/off switch from the appliance in order to test it.\nSet your multi-meter to the Rx1 setting and place the probes on the switch’s terminals. You should receive a reading of zero. With the probes still on the terminals press in on the switch, the reading should change to infinity.\nIf your tests produce results different from those above, you will need a replacement dispenser door switch.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Lights and Bulbs\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n✖",
    "scraped_at": "2026-02-11T19:36:17.044082"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator That's Too Cold",
    "url": "https://www.partselect.com/Repair/Refrigerator/Refrigerator-Too-Cold/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"The air damper, baffle or diffuser is the device that balances the air flow from the evaporator fan housing. This normally is a mechanically controlled baffle or flapper that controls the amount of cold air entering the fresh food compartment. If the baffle is damaged or the linkage to the control knob is damaged, then too much cold air may enter the fresh food compartment resulting in lower than normal temperatures. The baffle or damper will be located where the cold air enters the fresh food c\"}, {\"step_number\": 2, \"instruction\": \"How to inspect a refrigerator\\u2019s air inlet damper or baffle:\"}, {\"step_number\": 3, \"instruction\": \"Some electronic controls models will use a thermistor to sense the temperature. The electronic control monitors this temperature and will automatically adjust the damper. The temperature sensor is normally a plastic encased capsule with two wires attached and may be located near the air inlet. The thermistor will have a specific resistance based on temperature and is therefore difficult to diagnose without the manufacturer\\u2019s specifications. Some models may indicate a fault code when the sensor i\"}, {\"step_number\": 4, \"instruction\": \"How to test a refrigerator temperature sensor or thermistor with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"Some newer models may have an electronic control board that controls all of the refrigerators functions. Sensors are connected to the board that monitor fresh food and freezer compartment temperatures and the control board will use that information to operate the compressor and fans as well as the defrost system and in some cases the air baffle/damper to balance temperatures. A defective control board could cause a symptom of the fresh food compartment being too cold, but you should first elimin\"}, {\"step_number\": 6, \"instruction\": \"How to inspect a refrigerator\\u2019s main control board:\"}, {\"step_number\": 7, \"instruction\": \"The cold control thermostat monitors the temperature inside the refrigerator and will operate the compressor and fans when the temperature rises. The control is often labeled as the refrigerator control but in some models may be called the freezer control. The control will have wires attached to it that operate the compressor circuit and will normally have an \\\"off\\\" setting on the knob. If the control is defective it may create a symptom of the fresh food section being too cold but would also low\"}, {\"step_number\": 8, \"instruction\": \"How to test your fridge\\u2019s cold control & temperature control with a multi-meter:\"}, {\"step_number\": 9, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 9,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=t67G2YUuyWs",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > FRIDGE TOO COLD\n    \nHow To Fix A Refrigerator That's Too Cold\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Air Inlet Damper Or Baffle\n                        \n\n                            Temperature Sensor Or Thermistor\n                        \n\n                            Main Control Board\n                        \n\n                            Cold Control Or Temperature Control\n                        \n\n\nAbout this repair:\n\nRated as REALLY EASY257 repair stories2 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nAir Inlet Damper Or Baffle\n\n\nThe air damper, baffle or diffuser is the device that balances the air flow from the evaporator fan housing. This normally is a mechanically controlled baffle or flapper that controls the amount of cold air entering the fresh food compartment. If the baffle is damaged or the linkage to the control knob is damaged, then too much cold air may enter the fresh food compartment resulting in lower than normal temperatures. The baffle or damper will be located where the cold air enters the fresh food compartment. The housing that the baffle or damper is encased in is often made of plastic with a Styrofoam lining and may have a foam seal to prevent air leakage.\nHow to inspect a refrigerator’s air inlet damper or baffle:\n\nUnplug your refrigerator and locate the damper or baffle. It is usually found where the cold air enters the fresh food compartment.\nUse caution when inspecting the baffle or damper to not damage the plastic & Styrofoam housing that the baffle or damper is encased in.\nIf your model of has a temperature sensing bulb attached to this control make sure that the sensing bulb is in the correct position and not damaged.\nThe control knob should move freely, try to move it to verify that the linkage is intact and that it moves freely.\nIf the damper/baffle is stuck in the closed or nearly closed position or does not move freely, then you need a replacement air inlet damper or baffle.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nTemperature Sensor Or Thermistor\n\n\nSome electronic controls models will use a thermistor to sense the temperature. The electronic control monitors this temperature and will automatically adjust the damper. The temperature sensor is normally a plastic encased capsule with two wires attached and may be located near the air inlet. The thermistor will have a specific resistance based on temperature and is therefore difficult to diagnose without the manufacturer’s specifications. Some models may indicate a fault code when the sensor is faulty.\nHow to test a refrigerator temperature sensor or thermistor with a multi-meter:\n\nVerify that you have disconnected your appliance from the power source as you will be inspecting electrical components.\nThe thermistor(s) will be connected to the main control board, you will need to remove the back panel of your fridge to access the control board. Remove the thermistor(s) from the appliance in order to test them.\nThermistor(s) will produce different multi-meter readings based on their temperature when you test them. The ranges below only apply to thermistors at 32 degrees F. Before testing them, you will need to place the thermistor(s) in ice water for 5 minutes to bring the temperature to 32 degrees F.\nSet your multi-meter to the Rx1 setting and touch the probes to the terminals, you should receive a reading of 16,600 ohms (+/- 5 percent).\nIf you receive a reading outside this range, you will need a replacement temperature sensor or thermistor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Sensors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nMain Control Board\n\n\nSome newer models may have an electronic control board that controls all of the refrigerators functions. Sensors are connected to the board that monitor fresh food and freezer compartment temperatures and the control board will use that information to operate the compressor and fans as well as the defrost system and in some cases the air baffle/damper to balance temperatures. A defective control board could cause a symptom of the fresh food compartment being too cold, but you should first eliminate the sensors and the damper before changing the control. Some manufacturers may provide detailed information on the procedure for testing the board and the sensors.\nHow to inspect a refrigerator’s main control board:\n\nDisconnect your refrigerator from the power source, you will be inspecting electrical components.\nThe main control board is usually found inside the control box, which is inside the fridge, attached to the top or side of the fridge. Locate and remove the main control board from your appliance.\nLooking for any signs of damaged foil, wear, burnt connections, arcing, or any other damage, inspect your main control board.\nIf you find a",
    "scraped_at": "2026-02-11T19:36:18.233168"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator That's Running Too Long",
    "url": "https://www.partselect.com/Repair/Refrigerator/Running-Too-Long/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"The defrost timer can be either a mechanical timer or an electronic \\\"adaptive defrost control\\\". Both are used to initiate the defrost cycle by turning on the defrost heater at specific intervals and for a specific amount of time. Mechanical timers are more common and usually activate a defrost cycle every 8-10 hours of compressor run time. This normally occurs about once every day or two. The defrost cycle will normally terminate after 20 to 30 minutes and the compressor and fans will start agai\"}, {\"step_number\": 2, \"instruction\": \"How to test a refrigerator defrost timer with a multi-meter:\"}, {\"step_number\": 3, \"instruction\": \"The defrost heater is controlled by the defrost timer or adaptive defrost control and the defrost termination thermostat. The heater is normally a glass encased heater wire with well insulated wire leads.\"}, {\"step_number\": 4, \"instruction\": \"How to test a refrigerator defrost heater with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"The defrost termination thermostat is used as a safety device to turn off the defrost heater when the temperature reaches a specific limit. The thermostat is normally wired in series with the defrost element and is normally open circuit above 35\\u00b0- 47\\u00b0 Fahrenheit. For this reason it is sometimes difficult to check the continuity of the thermostat unless you are sure that the temperature is low enough to close the circuit. Newer style thermostats may have an internal bias resistor to aid in testin\"}, {\"step_number\": 6, \"instruction\": \"How to test a refrigerator\\u2019s defrost thermostat with a multi-meter:\"}, {\"step_number\": 7, \"instruction\": \"Leaky or damaged door seals can create long run times but normally will just create excess moisture that is visible near the air outlet ducts or on shelves in the freezer. Moisture along the edge of the door is also a good indication that the gaskets are not sealing properly and should be replaced.\"}, {\"step_number\": 8, \"instruction\": \"How to inspect refrigerator door gaskets:\"}, {\"step_number\": 9, \"instruction\": \"If your fridge sounds like it\\u2019s running more often than normal, the condenser fan motor could be to blame. If the condenser cannot expel heat efficiently, then the compressor and sealed system work harder to keep the refrigerator cold. Check for higher than normal surface temperatures on the cabinet between the fresh food and freezer doors as this area contains tubing attached to the condenser and will heat up if the condenser cannot be cooled fast enough.\"}, {\"step_number\": 10, \"instruction\": \"How to inspect a refrigerator condenser fan motor:\"}, {\"step_number\": 11, \"instruction\": \"The evaporator fan is used to draw air over the evaporator coil and circulate the cold air throughout the fresh food and freezer compartments. If the evaporator fan does not work then the control thermostat or sensor may not correctly sense the temperature and the compressor will continue to run longer than normal. The fresh food and freezer compartment temperatures will increase as well.\"}, {\"step_number\": 12, \"instruction\": \"How to inspect a refrigerator evaporator fan motor:\"}, {\"step_number\": 13, \"instruction\": \"The sealed system in a refrigerator is comprised of the evaporator, the condenser and the compressor and the associated tubing. A defect in any of these components can cause a symptom of running too long or not cooling enough, and would have to be tested and/or serviced by a qualified refrigeration technician as it involves live voltage tests.\"}, {\"step_number\": 14, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 14,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=dGdrBnsEZug",
    "video_count": 1,
    "full_content": "REPAIR >  REFRIGERATOR  > RUNNING TOO LONG\n    \nHow To Fix A Refrigerator That's Running Too Long\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Defrost Timer\n                        \n\n                            Defrost Heater\n                        \n\n                            Defrost Termination Thermostat\n                        \n\n                            Fresh & Freezer Door Gaskets\n                        \n\n                            Condenser Fan Motor\n                        \n\n                            Evaporator Fan Motor\n                        \n\n                            Sealed System\n                        \n\n\nAbout this repair:\n\nRated as EASY2772 repair stories50 step by step videos\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nDefrost Timer\n\n\nThe defrost timer can be either a mechanical timer or an electronic \"adaptive defrost control\". Both are used to initiate the defrost cycle by turning on the defrost heater at specific intervals and for a specific amount of time. Mechanical timers are more common and usually activate a defrost cycle every 8-10 hours of compressor run time. This normally occurs about once every day or two. The defrost cycle will normally terminate after 20 to 30 minutes and the compressor and fans will start again. Adaptive defrost controls will monitor ambient conditions and previous defrost cycles and adapt the defrost cycle frequency and length to be more efficient.\nHow to test a refrigerator defrost timer with a multi-meter:\n\nUnplug your refrigerator before beginning.\nLocate & remove the defrost timer from the appliance in order to test it. It can be found behind the refrigerator's lower kickplate, in the refrigerator's control panel, or even behind the refrigerator on its back wall.\nSet your multi-meter to the Rx1 setting and touch one probe to the common terminal (it should be labeled \"3\" or \"C\"). One at a time, touch the other lead to the other three remaining terminals. Testing the first pair should produce a reading of zero, or near zero, denoting continuity. The second pair may also result in a reading of zero or near zero. Testing the third pair of terminals should produce a reading of infinity.\nIf you receive different readings, you will need a replacement defrost timer.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Timers\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a defrost timer \nHow to replace a defrost timer\n\n\n\n\n\nBack to Top\n\n\nDefrost Heater\n\n\nThe defrost heater is controlled by the defrost timer or adaptive defrost control and the defrost termination thermostat. The heater is normally a glass encased heater wire with well insulated wire leads.\nHow to test a refrigerator defrost heater with a multi-meter:\n\nUnplug your refrigerator before starting, you will be inspecting electrical components.\nRemove your defrost heater. Defrost heaters are commonly located beneath a refrigerator's evaporator coils. You will have to remove any objects that are in your way such as shelves, icemaker parts, and the inside rear, back, or bottom panel(s). The defrost heater will have two wires connected to it, carefully grasp the metal connectors to remove them, do not pull the wires themselves.\nWith your multi-meter set onto Rx1 mode, place the probes onto the terminals of the defrost heater. You are testing for continuity and you should receive a reading between zero and infinity.\nIf you receive a reading of zero or infinity, you will need a replacement defrost heater.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\nHow to test a defrost heater \nHow to replace a defrost heater\n\n\n\n\n\nBack to Top\n\n\nDefrost Termination Thermostat\n\n\nThe defrost termination thermostat is used as a safety device to turn off the defrost heater when the temperature reaches a specific limit. The thermostat is normally wired in series with the defrost element and is normally open circuit above 35°- 47° Fahrenheit. For this reason it is sometimes difficult to check the continuity of the thermostat unless you are sure that the temperature is low enough to close the circuit. Newer style thermostats may have an internal bias resistor to aid in testing both the thermostat and the heater. The wiring diagram will normally indicate this.\nHow to test a refrigerator’s defrost thermostat with a multi-meter:\n\nBecause you will be testing electrical components, ensure you have disconnected your appliance from the power source before beginning.\n Locate and remove the defrost thermostat in order to test it. In freezer-on-top models, it may be located under the floor of the unit, or it could be found at the back of the freezer. If you have a side-by-side refrigerator, the defrost thermostat is found at the back of the freezer side. You will have to remove any objects that are in your way, such as the contents of the freezer, freezer shelves, icemaker parts, and t",
    "scraped_at": "2026-02-11T19:36:19.198943"
  },
  {
    "appliance_type": "refrigerator",
    "symptom": "How To Fix A Refrigerator Freezer That's Too Cold",
    "url": "https://www.partselect.com/Repair/Refrigerator/Freezer-Too-Cold/",
    "description": "",
    "difficulty": "",
    "repair_time": "",
    "tools_required": "",
    "repair_steps": "[{\"step_number\": 1, \"instruction\": \"If the freezer section is too cold and the fresh food section temperature is normal you should suspect that the air damper or freezer control is adjusted improperly or may be defective, and is deflecting more than the normal amount of air into the freezer section and not enough into the fresh food compartment to satisfy the cold control and turn off the compressor.\"}, {\"step_number\": 2, \"instruction\": \"How to inspect a refrigerator\\u2019s air damper or freezer control:\"}, {\"step_number\": 3, \"instruction\": \"In models that use an Electronic Control, a thermistor or temperature sensor may be used to monitor fresh food and freezer temperatures. The control board uses this information to turn on the compressor and fan circuits as well as to operate the damper control on some models. If the sensor becomes damaged or defective it may incorrectly signal the control board to close the air damper too much and result in colder than normal freezer temperatures. Individual manufacturers may have specific infor\"}, {\"step_number\": 4, \"instruction\": \"How to test a refrigerator temperature sensor or thermistor with a multi-meter:\"}, {\"step_number\": 5, \"instruction\": \"Still not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\"}]",
    "repair_steps_count": 5,
    "related_parts": "",
    "related_parts_count": 0,
    "video_urls": "https://www.youtube.com/watch?v=dGdrBnsEZug",
    "video_count": 1,
    "full_content": "REPAIR > REFRIGERATOR > FREEZER TOO COLD\n    \nHow To Fix A Refrigerator Freezer That's Too Cold\n\n\n\n\n\n\nClick a Part Below to Start Your Repair:\n\n                            Air Damper Or Freezer Control\n                        \n\n                            Temperature Sensor Or Thermistor\n                        \n\n\nAbout this repair:\n\nRated as REALLY EASY44 repair stories1 step by step video\n\n\n\nWant Mr. Appliance to fix that broken Refrigerator?Schedule Service\n\nAir Damper Or Freezer Control\n\n\nIf the freezer section is too cold and the fresh food section temperature is normal you should suspect that the air damper or freezer control is adjusted improperly or may be defective, and is deflecting more than the normal amount of air into the freezer section and not enough into the fresh food compartment to satisfy the cold control and turn off the compressor. \nHow to inspect a refrigerator’s air damper or freezer control:\n\nUnplug your refrigerator before beginning.\nLocate your air damper or freezer control. It will usually be found in the fresh food compartment, behind a vent found on the top or side of the fridge.\nRemove the vent and inspect the damper flap for any signs of wear or damage, attempt to manually move the flap. You should feel little or no resistance.\nIf you find any issues when performing the above checks, you will need a replacement air damper or freezer control. If you do not find the issue, suspect the evaporator coils or motor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Parts\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\nTemperature Sensor Or Thermistor\n\n\nIn models that use an Electronic Control, a thermistor or temperature sensor may be used to monitor fresh food and freezer temperatures. The control board uses this information to turn on the compressor and fan circuits as well as to operate the damper control on some models. If the sensor becomes damaged or defective it may incorrectly signal the control board to close the air damper too much and result in colder than normal freezer temperatures. Individual manufacturers may have specific information available to test these sensors, depending on the model involved, and may also provide a fault code on the electronic control board on some models.\nHow to test a refrigerator temperature sensor or thermistor with a multi-meter:\n\nDisconnect your refrigerator from the power source and then remove the back panel of your refrigerator to locate the main control board.\nLocate and remove the thermistor(s), they will be attached to the main control board.\nPlace the thermistor(s) in ice water for 5 minutes before testing. The amount of resistance in a thermistor varies based on what their surface temperature is when they are measured. The range below only applies to thermistors measured at 32 degrees F.\nUsing a multi-meter on Rx1 mode, touch the terminals with the meter’s probes. The test should produce a reading of 16,600 ohms (+/- 5 percent).\nIf you receive a reading outside this range, you will need a replacement temperature sensor or thermistor.\n\n\n\n\n\nStart Your Repair Here\nView All Refrigerator Sensors\n\n\n\n\n\n\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n\n\n\nBack to Top\n\n\n\nMore Repair Parts\nStill not sure which part is broken? We can offer you custom troubleshooting help if you search with your model number.\n\nEnter model or part number\n\n\nSEARCH\n\n\nNeed help finding your model number?\n\n\n\n\n\n\n✖",
    "scraped_at": "2026-02-11T19:36:21.202875"
  }
]